{
  "eczema": {
    "name": "eczema (chàm da)",
    "treatment": [
      "Topical corticosteroids - giảm viêm và ngứa.",
      "Topical calcineurin inhibitors (như tacrolimus hoặc pimecrolimus) - giảm viêm và ngứa, đặc biệt là ở các khu vực nhạy cảm như mặt và cổ.",
      "Topical phosphodiesterase-4 inhibitors (như crisaborole) - giảm viêm và ngứa.",
      "Topical barrier repair creams - giúp phục hồi và bảo vệ hàng rào da."
    ]
  },
  "acne": {
    "name": "acne (mụn trứng cá)",
    "treatment": [
      "Topical retinoids (như tretinoin) - giúp thông thoáng lỗ chân lông và ngăn ngừa sự hình thành mụn mới.",
      "Benzoyl peroxide - diệt khuẩn và giảm viêm.",
      "Salicylic acid - giúp thông thoáng lỗ chân lông và giảm viêm.",
      "Topical antibiotics (như clindamycin) - giúp diệt khuẩn và giảm viêm.",
      "Oral antibiotics (như doxycycline) - giúp diệt khuẩn và giảm viêm."
    ]
  },
  "BCC": {
    "name": "Basal cell carcinoma (ung thư biểu mô tế bào đáy)",
    "treatment": [
      "Surgical excision - loại bỏ khối u và mô xung quanh.",
      "Mohs surgery - loại bỏ mô ung thư từng lớp một, giảm thiểu tổn thương mô lành.",
      "Radiation therapy - sử dụng bức xạ năng lượng cao để tiêu diệt tế bào ung thư.",
      "Topical chemotherapy - sử dụng kem hoặc lotion chứa thuốc để diệt tế bào ung thư."
    ]
  },
  "BKL": {
    "name": "Benign Keratosis-like Lesions (BKL) - Tổn thương giống dày sừng lành tính",
    "treatment": [
      "Cryotherapy - sử dụng nitơ lỏng để làm đông lạnh và loại bỏ tổn thương.",
      "Electrodesiccation and curettage - cạo bỏ tổn thương và sử dụng kim điện để phá hủy các tế bào còn lại.",
      "Topical medications (như imiquimod) - kích thích hệ miễn dịch tấn công tổn thương.",
      "Shave excision - cạo bỏ tổn thương bằng dao phẫu thuật."
    ]
  },
  "DF": {
    "name": "Dermatofibroma (u xơ da)",
    "treatment": [
      "Surgical excision - loại bỏ u xơ và mô xung quanh.",
      "Cryotherapy - sử dụng nitơ lỏng để làm đông lạnh và loại bỏ u xơ.",
      "Laser therapy - sử dụng laser để phá hủy u xơ.",
      "Shave excision - cạo bỏ u xơ bằng dao phẫu thuật."
    ]
  },
  "AK": {
    "name": "Actinic keratosis (AK) - dày sừng quang hóa",
    "treatment": [
      "Cryotherapy - sử dụng nitơ lỏng để làm đông lạnh và loại bỏ tổn thương.",
      "Topical medications (như imiquimod) - kích thích hệ miễn dịch tấn công tổn thương.",
      "Chemical peels - sử dụng dung dịch hóa học để loại bỏ tổn thương.",
      "Photodynamic therapy - sử dụng thuốc và ánh sáng để phá hủy tổn thương."
    ]
  },
  "SCC": {
    "name": "Squamous Cell Carcinoma (ung thư biểu mô tế bào vảy)",
    "treatment": [
      "Surgical excision - loại bỏ khối u và mô xung quanh.",
      "Mohs surgery - loại bỏ mô ung thư từng lớp một, giảm thiểu tổn thương mô lành.",
      "Radiation therapy - sử dụng bức xạ năng lượng cao để tiêu diệt tế bào ung thư.",
      "Topical chemotherapy - sử dụng kem hoặc lotion chứa thuốc để diệt tế bào ung thư."
    ]
  },
  "VASC": {
    "name": "Vascular Lesions (tổn thương mạch máu)",
    "treatment": [
      "Laser therapy - sử dụng laser để phá hủy các mạch máu gây ra tổn thương.",
      "Sclerotherapy - tiêm dung dịch vào mạch máu để làm cho chúng co lại và biến mất.",
      "Electrocautery - sử dụng kim điện để phá hủy các mạch máu gây ra tổn thương.",
      "Surgical excision - loại bỏ tổn thương và mô xung quanh."
    ]
  },
  "MEL": {
    "name": "Melanoma (ung thư hắc tố)",
    "treatment": [
      "Surgical excision - loại bỏ khối u và mô xung quanh.",
      "Immunotherapy - sử dụng thuốc kích thích hệ miễn dịch tấn công tế bào ung thư.",
      "Chemotherapy - sử dụng thuốc để tiêu diệt tế bào ung thư.",
      "Radiation therapy - sử dụng bức xạ năng lượng cao để tiêu diệt tế bào ung thư."
    ]
  },
  "NV": {
    "name": "Nevi (nốt ruồi)",
    "treatment": [
      "Monitoring for changes in size, shape, or color - theo dõi các thay đổi về kích thước, hình dạng hoặc màu sắc để phát hiện các dấu hiệu tiềm ẩn của ung thư hắc tố.",
      "Surgical excision - loại bỏ nốt ruồi nếu nó không điển hình hoặc có dấu hiệu ung thư.",
      "Laser therapy - sử dụng laser để loại bỏ nốt ruồi.",
      "Cryotherapy - sử dụng nitơ lỏng để làm đông lạnh và loại bỏ nốt ruồi."
    ]
  },
  "not_infected": {
    "name": "Not Infected (không bị nhiễm trùng)",
    "treatment": [
      "Regular skin care routine - chăm sóc da đều đặn - làm sạch, dưỡng ẩm và bảo vệ da khỏi tác hại của ánh nắng.",
      "Avoiding triggers - tránh các tác nhân gây kích ứng hoặc dị ứng có thể làm tình trạng da xấu đi.",
      "Using gentle skincare products - sử dụng các sản phẩm chăm sóc da nhẹ nhàng để tránh gây kích ứng hoặc viêm.",
      "Seeking medical advice - tham khảo ý kiến bác sĩ nếu triệu chứng kéo dài hoặc tồi tệ hơn, hoặc nếu xuất hiện các vấn đề da mới."
    ]
  }
}
